app/controllers/shmeals_controller.rb

  def index
    @shmeals = Shmeal.all
---
SELECT "shmeals".* FROM "shmeals"

  def future

    #Looks for upcoming shmeals between now and next month

    @shmeals = Shmeal.where({shmealDayDate: Date.today.prev_day..Date.today.next_month})
---
SELECT "shmeals".* FROM "shmeals" WHERE ("shmeals"."shmealDayDate" BETWEEN $1 AND $2)  [["shmealDayDate", "2018-06-13"], ["shmealDayDate", "2018-07-14"]]

  def show
    @shmeal = Shmeal.find(params[:id])
---
SELECT  "shmeals".* FROM "shmeals" WHERE "shmeals"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]