app/controllers/shmuserattributes_controller.rb

  def index
    @shmuserattributes = Shmuserattribute.all
---
SELECT "shmuserattributes".* FROM "shmuserattributes"