app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."userEmail" = $1 LIMIT $2  [["userEmail", "hamerjm@gmail"], ["LIMIT", 1]]
---
  def login
    user = User.where(userEmail: params[:userEmail]+".com")

INSERT INTO "users" ("homeAddressLat", "homeAddressLon", "userBlurb", "userEmail", "userInstructions", "userName", "userPhoneNumber", "userScore", "userTotalShmeals", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    @user.freeShmeals = 1;

    if @user.save